Microchip-MPLAB-Harmony/csp/apps/trustZone/eic/NonSecure/firmware/src/packs/ATSAML11E16A_DFP/component/port.h
/* -------- PORT_INTENSET : (PORT Offset: 0x64) (R/W 32) Interrupt Enable Set -------- */
#define PORT_INTENSET_RESETVALUE              _U_(0x00)                                            /**<  (PORT_INTENSET) Interrupt Enable Set  Reset Value */

#define PORT_INTENSET_NSCHK_Pos               _U_(0)                                               /**< (PORT_INTENSET) Non-Secure Check Interrupt Enable Position */
#define PORT_INTENSET_NSCHK_Msk               (_U_(0x1) << PORT_INTENSET_NSCHK_Pos)                /**< (PORT_INTENSET) Non-Secure Check Interrupt Enable Mask */
#define PORT_INTENSET_NSCHK(value)            (PORT_INTENSET_NSCHK_Msk & ((value) << PORT_INTENSET_NSCHK_Pos))
#define PORT_INTENSET_Msk                     _U_(0x00000001)                                      /**< (PORT_INTENSET) Register Mask  */


/* -------- PORT_INTFLAG : (PORT Offset: 0x68) (R/W 32) Interrupt Flag Status and Clear -------- */
#define PORT_INTFLAG_RESETVALUE               _U_(0x00)                                            /**<  (PORT_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define PORT_INTFLAG_NSCHK_Pos                _U_(0)                                               /**< (PORT_INTFLAG) Non-Secure Check Position */
#define PORT_INTFLAG_NSCHK_Msk                (_U_(0x1) << PORT_INTFLAG_NSCHK_Pos)                 /**< (PORT_INTFLAG) Non-Secure Check Mask */
#define PORT_INTFLAG_NSCHK(value)             (PORT_INTFLAG_NSCHK_Msk & ((value) << PORT_INTFLAG_NSCHK_Pos))
#define PORT_INTFLAG_Msk                      _U_(0x00000001)                                      /**< (PORT_INTFLAG) Register Mask  */


/* -------- PORT_NONSEC : (PORT Offset: 0x6C) (R/W 32) Security Attribution -------- */
#define PORT_NONSEC_RESETVALUE                _U_(0x00)                                            /**<  (PORT_NONSEC) Security Attribution  Reset Value */

#define PORT_NONSEC_NONSEC_Pos                _U_(0)                                               /**< (PORT_NONSEC) Port Security Attribution Position */
#define PORT_NONSEC_NONSEC_Msk                (_U_(0xFFFFFFFF) << PORT_NONSEC_NONSEC_Pos)          /**< (PORT_NONSEC) Port Security Attribution Mask */
#define PORT_NONSEC_NONSEC(value)             (PORT_NONSEC_NONSEC_Msk & ((value) << PORT_NONSEC_NONSEC_Pos))
#define PORT_NONSEC_Msk                       _U_(0xFFFFFFFF)                                      /**< (PORT_NONSEC) Register Mask  */


/* -------- PORT_NSCHK : (PORT Offset: 0x70) (R/W 32) Security Attribution Check -------- */
#define PORT_NSCHK_RESETVALUE                 _U_(0x00)                                            /**<  (PORT_NSCHK) Security Attribution Check  Reset Value */

#define PORT_NSCHK_NSCHK_Pos                  _U_(0)                                               /**< (PORT_NSCHK) Port Security Attribution Check Position */
#define PORT_NSCHK_NSCHK_Msk                  (_U_(0xFFFFFFFF) << PORT_NSCHK_NSCHK_Pos)            /**< (PORT_NSCHK) Port Security Attribution Check Mask */
#define PORT_NSCHK_NSCHK(value)               (PORT_NSCHK_NSCHK_Msk & ((value) << PORT_NSCHK_NSCHK_Pos))
#define PORT_NSCHK_Msk                        _U_(0xFFFFFFFF)                                      /**< (PORT_NSCHK) Register Mask  */


/** \brief PORT register offsets definitions */
#define PORT_DIR_REG_OFST              (0x00)              /**< (PORT_DIR) Data Direction Offset */
#define PORT_DIRCLR_REG_OFST           (0x04)              /**< (PORT_DIRCLR) Data Direction Clear Offset */
#define PORT_DIRSET_REG_OFST           (0x08)              /**< (PORT_DIRSET) Data Direction Set Offset */
#define PORT_DIRTGL_REG_OFST           (0x0C)              /**< (PORT_DIRTGL) Data Direction Toggle Offset */
#define PORT_OUT_REG_OFST              (0x10)              /**< (PORT_OUT) Data Output Value Offset */
#define PORT_OUTCLR_REG_OFST           (0x14)              /**< (PORT_OUTCLR) Data Output Value Clear Offset */
#define PORT_OUTSET_REG_OFST           (0x18)              /**< (PORT_OUTSET) Data Output Value Set Offset */
#define PORT_OUTTGL_REG_OFST           (0x1C)              /**< (PORT_OUTTGL) Data Output Value Toggle Offset */
#define PORT_IN_REG_OFST               (0x20)              /**< (PORT_IN) Data Input Value Offset */
#define PORT_CTRL_REG_OFST             (0x24)              /**< (PORT_CTRL) Control Offset */
#define PORT_WRCONFIG_REG_OFST         (0x28)              /**< (PORT_WRCONFIG) Write Configuration Offset */
#define PORT_EVCTRL_REG_OFST           (0x2C)              /**< (PORT_EVCTRL) Event Input Control Offset */
#define PORT_PMUX_REG_OFST             (0x30)              /**< (PORT_PMUX) Peripheral Multiplexing Offset */
#define PORT_PINCFG_REG_OFST           (0x40)              /**< (PORT_PINCFG) Pin Configuration Offset */
#define PORT_INTENCLR_REG_OFST         (0x60)              /**< (PORT_INTENCLR) Interrupt Enable Clear Offset */
#define PORT_INTENSET_REG_OFST         (0x64)              /**< (PORT_INTENSET) Interrupt Enable Set Offset */
#define PORT_INTFLAG_REG_OFST          (0x68)              /**< (PORT_INTFLAG) Interrupt Flag Status and Clear Offset */
#define PORT_NONSEC_REG_OFST           (0x6C)              /**< (PORT_NONSEC) Security Attribution Offset */
#define PORT_NSCHK_REG_OFST            (0x70)              /**< (PORT_NSCHK) Security Attribution Check Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief GROUP register API structure */
typedef struct
{
  __IO  uint32_t                       PORT_DIR;           /**< Offset: 0x00 (R/W  32) Data Direction */
  __IO  uint32_t                       PORT_DIRCLR;        /**< Offset: 0x04 (R/W  32) Data Direction Clear */
  __IO  uint32_t                       PORT_DIRSET;        /**< Offset: 0x08 (R/W  32) Data Direction Set */
  __IO  uint32_t                       PORT_DIRTGL;        /**< Offset: 0x0C (R/W  32) Data Direction Toggle */
  __IO  uint32_t                       PORT_OUT;           /**< Offset: 0x10 (R/W  32) Data Output Value */
  __IO  uint32_t                       PORT_OUTCLR;        /**< Offset: 0x14 (R/W  32) Data Output Value Clear */
  __IO  uint32_t                       PORT_OUTSET;        /**< Offset: 0x18 (R/W  32) Data Output Value Set */
  __IO  uint32_t                       PORT_OUTTGL;        /**< Offset: 0x1C (R/W  32) Data Output Value Toggle */
  __I   uint32_t                       PORT_IN;            /**< Offset: 0x20 (R/   32) Data Input Value */
  __IO  uint32_t                       PORT_CTRL;          /**< Offset: 0x24 (R/W  32) Control */
  __O   uint32_t                       PORT_WRCONFIG;      /**< Offset: 0x28 ( /W  32) Write Configuration */
  __IO  uint32_t                       PORT_EVCTRL;        /**< Offset: 0x2C (R/W  32) Event Input Control */
  __IO  uint8_t                        PORT_PMUX[16];      /**< Offset: 0x30 (R/W  8) Peripheral Multiplexing */
  __IO  uint8_t                        PORT_PINCFG[32];    /**< Offset: 0x40 (R/W  8) Pin Configuration */
  __IO  uint32_t                       PORT_INTENCLR;      /**< Offset: 0x60 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       PORT_INTENSET;      /**< Offset: 0x64 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       PORT_INTFLAG;       /**< Offset: 0x68 (R/W  32) Interrupt Flag Status and Clear */
  __IO  uint32_t                       PORT_NONSEC;        /**< Offset: 0x6C (R/W  32) Security Attribution */
  __IO  uint32_t                       PORT_NSCHK;         /**< Offset: 0x70 (R/W  32) Security Attribution Check */
  __I   uint8_t                        Reserved1[0x0C];
} port_group_registers_t;

#define GROUP_NUMBER _U_(1)

/** \brief PORT register API structure */
typedef struct
{  /* Port Module */
        port_group_registers_t         GROUP[GROUP_NUMBER]; /**< Offset: 0x00  */
} port_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAML11_PORT_COMPONENT_H_ */
